# FailureDefinitionAccessor Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureDefinitionAccessor Class
Members See Also
---
A class that provides access to the details of a FailureDefinition after the definition has been defined.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class FailureDefinitionAccessor : IDisposable
```

Visual Basic
---
```text
Public Class FailureDefinitionAccessor _
	Implements IDisposable
```

Visual C++
---
```text
public ref class FailureDefinitionAccessor : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FailureDefinitionAccessor
# See Also
FailureDefinitionAccessor Members
Autodesk.Revit.DB Namespace